    // Horizontal:
    //          💋  💋  🌲  💋
    //
    //          💋  🌲  💋  💋
    //
    //          🌲	💋	💋
    //          💋	🪐	🌈  Left up
    //
    //          💋	🪐	🌈  Left down
    //          🌲	💋	💋
    //
    //          💋	🪐	💋
    //          🌲	💋	🌈  Middle up
    //
    //          🌲	💋	🌈  Middle down
    //          💋	🪐	💋
    //
    //          💋	💋	🌈
    //          🌲	🪐	💋  Right up
    //
    //          🌲	🪐	💋  Right down
    //          💋	💋	🌈


    // Vertical:
    //          💋
    //          💋
    //          🌲
    //          💋
    //
    //          💋
    //          🌲
    //          💋
    //          💋
    //
    //          🌲  🪐  Left to right
    //          🌈  🌲
    //          💋  🌲
    //
    //          🪐  🌲  Right to left
    //          🌲  🌈
    //          🌲	💋
    //
    //          🌈  🌲
    //          🌲  🪐  Middle left to right
    //          💋  🌲
    //
    //          🌲  🌈
    //          🪐  🌲  Middle right to left
    //          🌲  💋
    //
    //          🌈  🌲
    //          💋  🌲
    //          🌲  🪐  Left to right
    //
    //          🌲  🌈
    //          🌲	💋
    //          🪐  🌲  Right to left